#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role_policy_attachment.eks_ssm_policy: Refreshing state... [id=my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_security_group_rule.nodes_outbound_cluster_https: Refreshing state... [id=sgrule-358068930]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05be6d6ef02b372b2]
aws_security_group_rule.cluster_inbound_https: Refreshing state... [id=sgrule-1590711956]
aws_iam_role_policy_attachment.bastion_ecr_policy: Refreshing state... [id=my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess]
aws_iam_role_policy_attachment.bastion_eks_policy: Refreshing state... [id=my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_eks_addon.ebs_csi: Refreshing state... [id=my-eks-cluster:aws-ebs-csi-driver]
aws_subnet.public[1]: Refreshing state... [id=subnet-0bf6d4cad207b9e2d]
aws_security_group.eks_cluster: Refreshing state... [id=sg-063b926018fae23b2]
aws_eks_cluster.main: Refreshing state... [id=my-eks-cluster]
aws_security_group.eks_nodes: Refreshing state... [id=sg-01931baff116b047f]
aws_vpc.main: Refreshing state... [id=vpc-073f94c7affa7476d]
aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::590184068436:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4]
aws_instance.bastion: Refreshing state... [id=i-04e25022a087c72f0]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08ef114ff8a9f4791]
aws_eip.nat: Refreshing state... [id=eipalloc-087250b7b49ccfc7d]
aws_route_table.public: Refreshing state... [id=rtb-02bdfb5911c8bcf60]
aws_security_group_rule.nodes_inbound_cluster_kubelet: Refreshing state... [id=sgrule-490981955]
aws_iam_instance_profile.bastion_profile: Refreshing state... [id=my-eks-cluster-bastion-profile]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ddb6bec68592dcbc]
aws_eks_node_group.main: Refreshing state... [id=my-eks-cluster:my-eks-cluster-nodes]
aws_iam_role.bastion_role: Refreshing state... [id=my-eks-cluster-bastion-role]
aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_policy.eks_basic_with_access_entries: Refreshing state... [id=arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries]
aws_iam_role_policy_attachment.eks_container_registry_policy: Refreshing state... [id=my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role.eks_node_group_role: Refreshing state... [id=my-eks-cluster-node-group-role]
aws_subnet.private[0]: Refreshing state... [id=subnet-0a194d64c04c62ef5]
aws_route_table.private: Refreshing state... [id=rtb-0f06fbca14b1c11a5]
aws_nat_gateway.main: Refreshing state... [id=nat-0d7887c4cee6a84fa]
aws_internet_gateway.main: Refreshing state... [id=igw-03cd6b26509b93ef3]
aws_subnet.public[0]: Refreshing state... [id=subnet-0bc99c5d9797184a3]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a5687f9ed0aec9eb]
aws_iam_role_policy_attachment.bastion_ssm_policy: Refreshing state... [id=my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_security_group.bastion: Refreshing state... [id=sg-01bb962ef6355449c]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f63c9d86c283283]
aws_ecr_repository.app_repo: Refreshing state... [id=my-eks-cluster-app]
aws_iam_role_policy_attachment.bastion_basic_access: Refreshing state... [id=my-eks-cluster-bastion-role/arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries]
aws_iam_role.eks_cluster_role: Refreshing state... [id=my-eks-cluster-cluster-role]
data.aws_ami.amazon_linux: Reading...
aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=my-eks-cluster-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_eks_addon.kube_proxy: Refreshing state... [id=my-eks-cluster:kube-proxy]
aws_eks_addon.vpc_cni: Refreshing state... [id=my-eks-cluster:vpc-cni]
aws_eks_addon.coredns: Refreshing state... [id=my-eks-cluster:coredns]
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0e2c86481225d3c51]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.app_repo will be destroyed
  # (because aws_ecr_repository.app_repo is not in configuration)
  - resource "aws_ecr_repository" "app_repo" {
      - arn                  = "arn:aws:ecr:us-east-1:590184068436:repository/my-eks-cluster-app" -> null
      - id                   = "my-eks-cluster-app" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "my-eks-cluster-app" -> null
      - region               = "us-east-1" -> null
      - registry_id          = "590184068436" -> null
      - repository_url       = "590184068436.dkr.ecr.us-east-1.amazonaws.com/my-eks-cluster-app" -> null
      - tags                 = {
          - "Name" = "my-eks-cluster-ecr-repo"
        } -> null
      - tags_all             = {
          - "Name" = "my-eks-cluster-ecr-repo"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_eip.nat will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-087250b7b49ccfc7d" -> null
      - arn                  = "arn:aws:ec2:us-east-1:590184068436:elastic-ip/eipalloc-087250b7b49ccfc7d" -> null
      - association_id       = "eipassoc-05e3f822f47396d54" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-087250b7b49ccfc7d" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-0c5eafb422f87f042" -> null
      - private_dns          = "ip-10-0-5-247.ec2.internal" -> null
      - private_ip           = "10.0.5.247" -> null
      - public_dns           = "ec2-23-23-125-50.compute-1.amazonaws.com" -> null
      - public_ip            = "23.23.125.50" -> null
      - public_ipv4_pool     = "amazon" -> null
      - region               = "us-east-1" -> null
      - tags                 = {
          - "Name" = "my-eks-cluster-nat-eip"
        } -> null
      - tags_all             = {
          - "Name" = "my-eks-cluster-nat-eip"
        } -> null
    }

  # aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "eks-nat-eip"
        }
      + tags_all             = {
          + "Name" = "eks-nat-eip"
        }
    }

  # aws_eks_addon.coredns must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ addon_version        = "v1.11.1-eksbuild.8" -> (known after apply)
      ~ arn                  = "arn:aws:eks:us-east-1:590184068436:addon/my-eks-cluster/coredns/86cc4a31-10fe-dba5-e94a-851d317c1944" -> (known after apply)
      ~ cluster_name         = "my-eks-cluster" -> "eks-cluster" # forces replacement
      + configuration_values = (known after apply)
      ~ created_at           = "2025-08-10T14:28:36Z" -> (known after apply)
      ~ id                   = "my-eks-cluster:coredns" -> (known after apply)
      ~ modified_at          = "2025-08-10T14:29:20Z" -> (known after apply)
      ~ tags                 = {
          ~ "Name" = "my-eks-cluster-coredns" -> "eks-coredns-addon"
        }
      ~ tags_all             = {
          ~ "Name" = "my-eks-cluster-coredns" -> "eks-coredns-addon"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_csi will be destroyed
  # (because aws_eks_addon.ebs_csi is not in configuration)
  - resource "aws_eks_addon" "ebs_csi" {
      - addon_name    = "aws-ebs-csi-driver" -> null
      - addon_version = "v1.35.0-eksbuild.1" -> null
      - arn           = "arn:aws:eks:us-east-1:590184068436:addon/my-eks-cluster/aws-ebs-csi-driver/38cc4a31-110f-6cd6-3ccb-da694c1fd413" -> null
      - cluster_name  = "my-eks-cluster" -> null
      - created_at    = "2025-08-10T14:28:36Z" -> null
      - id            = "my-eks-cluster:aws-ebs-csi-driver" -> null
      - modified_at   = "2025-08-10T14:29:28Z" -> null
      - region        = "us-east-1" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
    }

  # aws_eks_addon.kube_proxy must be replaced
-/+ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version        = "v1.31.0-eksbuild.5" -> (known after apply)
      ~ arn                  = "arn:aws:eks:us-east-1:590184068436:addon/my-eks-cluster/kube-proxy/e0cc4a31-1102-d0d6-c2e0-fa3004cbfea8" -> (known after apply)
      ~ cluster_name         = "my-eks-cluster" -> "eks-cluster" # forces replacement
      + configuration_values = (known after apply)
      ~ created_at           = "2025-08-10T14:28:36Z" -> (known after apply)
      ~ id                   = "my-eks-cluster:kube-proxy" -> (known after apply)
      ~ modified_at          = "2025-08-10T14:29:14Z" -> (known after apply)
      ~ tags                 = {
          ~ "Name" = "my-eks-cluster-kube-proxy" -> "eks-kube-proxy-addon"
        }
      ~ tags_all             = {
          ~ "Name" = "my-eks-cluster-kube-proxy" -> "eks-kube-proxy-addon"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni must be replaced
-/+ resource "aws_eks_addon" "vpc_cni" {
      ~ addon_version        = "v1.18.1-eksbuild.3" -> (known after apply)
      ~ arn                  = "arn:aws:eks:us-east-1:590184068436:addon/my-eks-cluster/vpc-cni/e0cc4a31-1106-df54-376a-231b2ff1b191" -> (known after apply)
      ~ cluster_name         = "my-eks-cluster" -> "eks-cluster" # forces replacement
      + configuration_values = (known after apply)
      ~ created_at           = "2025-08-10T14:28:36Z" -> (known after apply)
      ~ id                   = "my-eks-cluster:vpc-cni" -> (known after apply)
      ~ modified_at          = "2025-08-10T14:29:15Z" -> (known after apply)
      ~ tags                 = {
          ~ "Name" = "my-eks-cluster-vpc-cni" -> "eks-vpc-cni-addon"
        }
      ~ tags_all             = {
          ~ "Name" = "my-eks-cluster-vpc-cni" -> "eks-vpc-cni-addon"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-cluster"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "eks-cluster"
        }
      + version                       = "1.32"

      + access_config {
          + authentication_mode                         = (known after apply)
          + bootstrap_cluster_creator_admin_permissions = (known after apply)
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = (known after apply)
            }
        }

      + upgrade_policy {
          + support_type = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_cluster.main will be destroyed
  # (because aws_eks_cluster.main is not in configuration)
  - resource "aws_eks_cluster" "main" {
      - arn                           = "arn:aws:eks:us-east-1:590184068436:cluster/my-eks-cluster" -> null
      - bootstrap_self_managed_addons = true -> null
      - certificate_authority         = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVTRIb0YyMUhESzh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBNE1UQXhOREV5TXpsYUZ3MHpOVEE0TURneE5ERTNNemxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURQYlh3VGpGSVFocDQ5Z2VQRkdnYS82Ukg0eUxzRkxsM3draVVaQXVrMEU3Qk0wT2V4ZjdnOVFSaDUKZjNEUThtbVhSUHlycjBpbEVIVzJPZGRGSW9sQ04xNWZBSmxQWUJDTkMxWEFmUlduNTJIcnVNZSsxUnBZZmU4awo4S3J2Z01XY2h6QzdwT1NTRjF3WDFWOXNPd2FNb2tYaHVwUDZTUHozQUd5VDVNMFMyT3FtQVFmUlZwTFFCS3doCitWaTZYVHRKRXZRaklQbGxLdHNXcUJKQWJUTjZqV1ZJa25wUE03S00vZWFVMzZYSVpmMllqZnN5Y2dlWHpQd3AKalpETlpMNWdOM2NoWEc5YXVMQ2p4elJkcXVDd3NUQzdZdk1JVEZva21yQ3NaQUgvSGtIZkRraHhzeUc5YnFsSgpjTUtwb3pWOWpOYUkyWVoxZ1daZ2diNXBpQWliQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdnlYNXRpQStsdW95YjN0V01rZ0lXRDV5NVpEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUZGMDVEN0lUawo0Y2JHblpjTy9WN1Y0MkV6VnE2bXE5ZG9pTHVZOWNrRkFBOWJtUVA1L2VEZmR6QXRDa0JtS25rY1dnZnNsMkVjCk9pb3lYZWc1RHErNmlpQ2tnZXZRWnBRZ295RStac3NzVVNNUU5VMS9HUkk1UmlITlR0N2tVSzl2ZFd1VHZHTTQKbm53QkFSWFRuTTBzcktXWkpjOTNoOUU0NEN3UTN2d2RLTU1sc2ZtVTJVNmZwVHgxTUd2elJoRTg1K3VzNkl0RQpuTjNQU2xCdkJzVHFXRXkzbEVTNjJPN1FrZmx4L0ZmZThoSGExRVRZZGtzbFBDUSttS1FxYStPYjU3aUh4UW1NCk1MVDR6UnVDUUhqY2g2Q1J2bC9TcFVKZ1RVbHppczZkOGJ1MHFOamlNSGlWU2c4cytCcTBrZlE2MWkzcTl4Vy8KenZITHNlQzBEdm41Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - created_at                    = "2025-08-10T14:12:22Z" -> null
      - enabled_cluster_log_types     = [
          - "api",
          - "audit",
          - "authenticator",
          - "controllerManager",
          - "scheduler",
        ] -> null
      - endpoint                      = "https://BFF4F811F0EACB4D8581ED34E0C79FE4.gr7.us-east-1.eks.amazonaws.com" -> null
      - id                            = "my-eks-cluster" -> null
      - identity                      = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4"
                    },
                ]
            },
        ] -> null
      - name                          = "my-eks-cluster" -> null
      - platform_version              = "eks.32" -> null
      - region                        = "us-east-1" -> null
      - role_arn                      = "arn:aws:iam::590184068436:role/my-eks-cluster-cluster-role" -> null
      - status                        = "ACTIVE" -> null
      - tags                          = {
          - "Name" = "my-eks-cluster"
        } -> null
      - tags_all                      = {
          - "Name" = "my-eks-cluster"
        } -> null
      - version                       = "1.31" -> null

      - access_config {
          - authentication_mode                         = "CONFIG_MAP" -> null
          - bootstrap_cluster_creator_admin_permissions = true -> null
        }

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null

          - elastic_load_balancing {
              - enabled = false -> null
            }
        }

      - upgrade_policy {
          - support_type = "EXTENDED" -> null
        }

      - vpc_config {
          - cluster_security_group_id = "sg-08308399422dbb0a7" -> null
          - endpoint_private_access   = true -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - security_group_ids        = [
              - "sg-063b926018fae23b2",
            ] -> null
          - subnet_ids                = [
              - "subnet-0a194d64c04c62ef5",
              - "subnet-0a5687f9ed0aec9eb",
              - "subnet-0bc99c5d9797184a3",
              - "subnet-0bf6d4cad207b9e2d",
            ] -> null
          - vpc_id                    = "vpc-073f94c7affa7476d" -> null
        }
    }

  # aws_eks_node_group.eks_node_group will be created
  + resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "eks-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "eks-node-group"
        }
      + tags_all               = {
          + "Name" = "eks-node-group"
        }
      + version                = (known after apply)

      + node_repair_config {
          + enabled = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # aws_eks_node_group.main will be destroyed
  # (because aws_eks_node_group.main is not in configuration)
  - resource "aws_eks_node_group" "main" {
      - ami_type        = "AL2_x86_64" -> null
      - arn             = "arn:aws:eks:us-east-1:590184068436:nodegroup/my-eks-cluster/my-eks-cluster-nodes/72cc4a2e-dc34-5a17-44fb-ff5057640694" -> null
      - capacity_type   = "ON_DEMAND" -> null
      - cluster_name    = "my-eks-cluster" -> null
      - disk_size       = 20 -> null
      - id              = "my-eks-cluster:my-eks-cluster-nodes" -> null
      - instance_types  = [
          - "t3.medium",
        ] -> null
      - labels          = {} -> null
      - node_group_name = "my-eks-cluster-nodes" -> null
      - node_role_arn   = "arn:aws:iam::590184068436:role/my-eks-cluster-node-group-role" -> null
      - region          = "us-east-1" -> null
      - release_version = "1.31.11-20250807" -> null
      - resources       = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-my-eks-cluster-nodes-72cc4a2e-dc34-5a17-44fb-ff5057640694"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status          = "ACTIVE" -> null
      - subnet_ids      = [
          - "subnet-0a194d64c04c62ef5",
          - "subnet-0a5687f9ed0aec9eb",
        ] -> null
      - tags            = {
          - "Name" = "my-eks-cluster-node-group"
        } -> null
      - tags_all        = {
          - "Name" = "my-eks-cluster-node-group"
        } -> null
      - version         = "1.31" -> null

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 4 -> null
          - min_size     = 1 -> null
        }

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # aws_iam_instance_profile.bastion_profile will be destroyed
  # (because aws_iam_instance_profile.bastion_profile is not in configuration)
  - resource "aws_iam_instance_profile" "bastion_profile" {
      - arn         = "arn:aws:iam::590184068436:instance-profile/my-eks-cluster-bastion-profile" -> null
      - create_date = "2025-08-10T14:11:57Z" -> null
      - id          = "my-eks-cluster-bastion-profile" -> null
      - name        = "my-eks-cluster-bastion-profile" -> null
      - path        = "/" -> null
      - role        = "my-eks-cluster-bastion-role" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPAYS2NWGVKDLWXYYVW3" -> null
    }

  # aws_iam_openid_connect_provider.eks will be destroyed
  # (because aws_iam_openid_connect_provider.eks is not in configuration)
  - resource "aws_iam_openid_connect_provider" "eks" {
      - arn             = "arn:aws:iam::590184068436:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4" -> null
      - client_id_list  = [
          - "sts.amazonaws.com",
        ] -> null
      - id              = "arn:aws:iam::590184068436:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4" -> null
      - tags            = {
          - "Name" = "my-eks-cluster-oidc-provider"
        } -> null
      - tags_all        = {
          - "Name" = "my-eks-cluster-oidc-provider"
        } -> null
      - thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> null
      - url             = "oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4" -> null
    }

  # aws_iam_policy.eks_basic_with_access_entries will be destroyed
  # (because aws_iam_policy.eks_basic_with_access_entries is not in configuration)
  - resource "aws_iam_policy" "eks_basic_with_access_entries" {
      - arn              = "arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries" -> null
      - attachment_count = 1 -> null
      - description      = "Allows EKS list/describe, Kubernetes API access, and managing EKS access entries." -> null
      - id               = "arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries" -> null
      - name             = "EKSBasicWithAccessEntries" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "eks:ListClusters",
                          - "eks:DescribeCluster",
                          - "eks:AccessKubernetesApi",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EksListDescribeAndK8sApi"
                    },
                  - {
                      - Action   = [
                          - "eks:CreateAccessEntry",
                          - "eks:DeleteAccessEntry",
                          - "eks:DescribeAccessEntry",
                          - "eks:ListAccessEntries",
                          - "eks:AssociateAccessPolicy",
                          - "eks:DisassociateAccessPolicy",
                          - "eks:ListAssociatedAccessPolicies",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "EksAccessEntriesManage"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAYS2NWGVKOUPD7EKH6" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # aws_iam_policy_attachment.full_access will be created
  + resource "aws_iam_policy_attachment" "full_access" {
      + id         = (known after apply)
      + name       = "eks-bastion-full-access"
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + roles      = [
          + "eks-bastion-role",
        ]
    }

  # aws_iam_role.bastion_role must be replaced
-/+ resource "aws_iam_role" "bastion_role" {
      ~ arn                   = "arn:aws:iam::590184068436:role/my-eks-cluster-bastion-role" -> (known after apply)
      ~ create_date           = "2025-08-10T14:11:56Z" -> (known after apply)
      ~ id                    = "my-eks-cluster-bastion-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries",
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> (known after apply)
      ~ name                  = "my-eks-cluster-bastion-role" -> "eks-bastion-role" # forces replacement
      + name_prefix           = (known after apply)
      ~ tags                  = {
          ~ "Name" = "my-eks-cluster-bastion-role" -> "eks-bastion-role"
        }
      ~ tags_all              = {
          ~ "Name" = "my-eks-cluster-bastion-role" -> "eks-bastion-role"
        }
      ~ unique_id             = "AROAYS2NWGVKJA7WBLHAZ" -> (known after apply)
        # (4 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_cluster_role must be replaced
-/+ resource "aws_iam_role" "eks_cluster_role" {
      ~ arn                   = "arn:aws:iam::590184068436:role/my-eks-cluster-cluster-role" -> (known after apply)
      ~ create_date           = "2025-08-10T14:11:56Z" -> (known after apply)
      ~ id                    = "my-eks-cluster-cluster-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
        ] -> (known after apply)
      ~ name                  = "my-eks-cluster-cluster-role" -> "eks-cluster-role" # forces replacement
      + name_prefix           = (known after apply)
      ~ tags                  = {
          ~ "Name" = "my-eks-cluster-cluster-role" -> "eks-cluster-role"
        }
      ~ tags_all              = {
          ~ "Name" = "my-eks-cluster-cluster-role" -> "eks-cluster-role"
        }
      ~ unique_id             = "AROAYS2NWGVKOAYP2XOCE" -> (known after apply)
        # (4 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_node_group_role will be destroyed
  # (because aws_iam_role.eks_node_group_role is not in configuration)
  - resource "aws_iam_role" "eks_node_group_role" {
      - arn                   = "arn:aws:iam::590184068436:role/my-eks-cluster-node-group-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-08-10T14:11:56Z" -> null
      - force_detach_policies = false -> null
      - id                    = "my-eks-cluster-node-group-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "my-eks-cluster-node-group-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "my-eks-cluster-node-group-role"
        } -> null
      - tags_all              = {
          - "Name" = "my-eks-cluster-node-group-role"
        } -> null
      - unique_id             = "AROAYS2NWGVKLANLKAQEP" -> null
    }

  # aws_iam_role_policy_attachment.bastion_basic_access will be destroyed
  # (because aws_iam_role_policy_attachment.bastion_basic_access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "bastion_basic_access" {
      - id         = "my-eks-cluster-bastion-role/arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries" -> null
      - policy_arn = "arn:aws:iam::590184068436:policy/EKSBasicWithAccessEntries" -> null
      - role       = "my-eks-cluster-bastion-role" -> null
    }

  # aws_iam_role_policy_attachment.bastion_ecr_policy will be destroyed
  # (because aws_iam_role_policy_attachment.bastion_ecr_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "bastion_ecr_policy" {
      - id         = "my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess" -> null
      - role       = "my-eks-cluster-bastion-role" -> null
    }

  # aws_iam_role_policy_attachment.bastion_eks_policy will be destroyed
  # (because aws_iam_role_policy_attachment.bastion_eks_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "bastion_eks_policy" {
      - id         = "my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "my-eks-cluster-bastion-role" -> null
    }

  # aws_iam_role_policy_attachment.bastion_ssm_policy will be destroyed
  # (because aws_iam_role_policy_attachment.bastion_ssm_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "bastion_ssm_policy" {
      - id         = "my-eks-cluster-bastion-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "my-eks-cluster-bastion-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      ~ id         = "my-eks-cluster-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> (known after apply)
      ~ role       = "my-eks-cluster-cluster-role" -> "eks-cluster-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.eks_cni_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      ~ id         = "my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> (known after apply)
      ~ role       = "my-eks-cluster-node-group-role" -> "eks-cluster-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.eks_container_registry_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_container_registry_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_container_registry_policy" {
      - id         = "my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "my-eks-cluster-node-group-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_ssm_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_ssm_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_ssm_policy" {
      - id         = "my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "my-eks-cluster-node-group-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_vpc_resource_controller_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_VPCResourceController"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_worker_node_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      - id         = "my-eks-cluster-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "my-eks-cluster-node-group-role" -> null
    }

  # aws_iam_role_policy_attachment.ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-cluster-role"
    }

  # aws_instance.bastion will be destroyed
  # (because aws_instance.bastion is not in configuration)
  - resource "aws_instance" "bastion" {
      - ami                                  = "ami-0e2c86481225d3c51" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:590184068436:instance/i-04e25022a087c72f0" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - force_destroy                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "my-eks-cluster-bastion-profile" -> null
      - id                                   = "i-04e25022a087c72f0" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0b1358f25ff0c9f96" -> null
      - private_dns                          = "ip-10-0-11-162.ec2.internal" -> null
      - private_ip                           = "10.0.11.162" -> null
      - public_dns                           = "ec2-54-196-153-130.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.196.153.130" -> null
      - region                               = "us-east-1" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0bc99c5d9797184a3" -> null
      - tags                                 = {
          - "Name" = "my-eks-cluster-bastion"
        } -> null
      - tags_all                             = {
          - "Name" = "my-eks-cluster-bastion"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = <<-EOT
            #!/bin/bash
            
            # Update the system
            yum update -y
            
            # Install required packages
            yum install -y curl wget git unzip
            
            
            # Install kubectl
            curl -LO "https://dl.k8s.io/release/$(curl -L -s https://dl.k8s.io/release/stable.txt)/bin/linux/amd64/kubectl"
            install -o root -g root -m 0755 kubectl /usr/local/bin/kubectl
            
            # Install eksctl
            curl --silent --location "https://github.com/weaveworks/eksctl/releases/latest/download/eksctl_$(uname -s)_amd64.tar.gz" | tar xz -C /tmp
            mv /tmp/eksctl /usr/local/bin
            
            # Install Helm
            curl -fsSL -o get_helm.sh https://raw.githubusercontent.com/helm/helm/main/scripts/get-helm-3
            chmod 700 get_helm.sh
            ./get_helm.sh
            
            # Install Docker (for building images)
            yum install -y docker
            systemctl start docker
            systemctl enable docker
            usermod -a -G docker ec2-user
            
            # Configure kubectl for the EKS cluster
            mkdir -p /home/ec2-user/.kube
            aws eks update-kubeconfig --region us-east-1 --name my-eks-cluster --kubeconfig /home/ec2-user/.kube/config
            chown -R ec2-user:ec2-user /home/ec2-user/.kube
            
            # Create helpful scripts for ec2-user
            cat << 'EOF' > /home/ec2-user/update-kubeconfig.sh
            #!/bin/bash
            aws eks update-kubeconfig --region us-east-1 --name my-eks-cluster
            echo "Kubeconfig updated for cluster: my-eks-cluster"
            EOF
            
            cat << 'EOF' > /home/ec2-user/get-cluster-info.sh
            #!/bin/bash
            echo "=== EKS Cluster Info ==="
            kubectl cluster-info
            echo ""
            echo "=== Nodes ==="
            kubectl get nodes
            echo ""
            echo "=== Pods in all namespaces ==="
            kubectl get pods --all-namespaces
            EOF
            
            chmod +x /home/ec2-user/*.sh
            chown ec2-user:ec2-user /home/ec2-user/*.sh
            
            # Create a welcome message
            cat << 'EOF' > /home/ec2-user/README.txt
            Welcome to the EKS Bastion Host!
            
            This instance is configured with:
            - AWS CLI v2
            - kubectl
            - eksctl
            - helm
            - docker
            
            Available scripts:
            - ./update-kubeconfig.sh - Updates kubectl configuration for the EKS cluster
            - ./get-cluster-info.sh - Shows cluster information and running pods
            
            The kubeconfig is already configured for cluster: my-eks-cluster
            
            To get started:
            1. Test cluster access: kubectl get nodes
            2. View pods: kubectl get pods --all-namespaces
            3. Access via SSM: aws ssm start-session --target $(curl -s http://169.254.169.254/latest/meta-data/instance-id)
            EOF
            
            chown ec2-user:ec2-user /home/ec2-user/README.txt
            
            # Install SSM agent (should already be installed on Amazon Linux 2)
            yum install -y amazon-ssm-agent
            systemctl start amazon-ssm-agent
            systemctl enable amazon-ssm-agent
            
            echo "Bastion host setup completed successfully!"
        EOT -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-01bb962ef6355449c",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0778010482128a2c6" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.bastion_host will be created
  + resource "aws_instance" "bastion_host" {
      + ami                                  = "ami-0e2c86481225d3c51"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "eks-bastion-role"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "eks-bastion-host"
        }
      + tags_all                             = {
          + "Name" = "eks-bastion-host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            yum update -y
            yum install -y aws-cli
            curl -LO https://s3.us-west-2.amazonaws.com/amazon-eks/1.32.3/2025-04-17/bin/linux/amd64/kubectl
            chmod +x ./kubectl
            mv ./kubectl /usr/local/bin/kubectl
            yum install -y amazon-ssm-agent
            systemctl start amazon-ssm-agent
            systemctl enable amazon-ssm-agent
            aws eks update-kubeconfig --region us-east-1 --name eks-cluster
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name" = "eks-igw"
        }
      + tags_all = {
          + "Name" = "eks-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_internet_gateway.main will be destroyed
  # (because aws_internet_gateway.main is not in configuration)
  - resource "aws_internet_gateway" "main" {
      - arn      = "arn:aws:ec2:us-east-1:590184068436:internet-gateway/igw-03cd6b26509b93ef3" -> null
      - id       = "igw-03cd6b26509b93ef3" -> null
      - owner_id = "590184068436" -> null
      - region   = "us-east-1" -> null
      - tags     = {
          - "Name" = "my-eks-cluster-igw"
        } -> null
      - tags_all = {
          - "Name" = "my-eks-cluster-igw"
        } -> null
      - vpc_id   = "vpc-073f94c7affa7476d" -> null
    }

  # aws_nat_gateway.main will be destroyed
  # (because aws_nat_gateway.main is not in configuration)
  - resource "aws_nat_gateway" "main" {
      - allocation_id                      = "eipalloc-087250b7b49ccfc7d" -> null
      - association_id                     = "eipassoc-05e3f822f47396d54" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0d7887c4cee6a84fa" -> null
      - network_interface_id               = "eni-0c5eafb422f87f042" -> null
      - private_ip                         = "10.0.5.247" -> null
      - public_ip                          = "23.23.125.50" -> null
      - region                             = "us-east-1" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-0bc99c5d9797184a3" -> null
      - tags                               = {
          - "Name" = "my-eks-cluster-nat-gateway"
        } -> null
      - tags_all                           = {
          - "Name" = "my-eks-cluster-nat-gateway"
        } -> null
    }

  # aws_nat_gateway.nat-gateway_id will be created
  + resource "aws_nat_gateway" "nat-gateway_id" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "eks-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "eks-nat-gateway"
        }
    }

  # aws_route_table.private will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:590184068436:route-table/rtb-0f06fbca14b1c11a5" -> null
      - id               = "rtb-0f06fbca14b1c11a5" -> null
      - owner_id         = "590184068436" -> null
      - propagating_vgws = [] -> null
      - region           = "us-east-1" -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0d7887c4cee6a84fa"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "my-eks-cluster-private-rt"
        } -> null
      - tags_all         = {
          - "Name" = "my-eks-cluster-private-rt"
        } -> null
      - vpc_id           = "vpc-073f94c7affa7476d" -> null
    }

  # aws_route_table.private_rt will be created
  + resource "aws_route_table" "private_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "eks-private-rt"
        }
      + tags_all         = {
          + "Name" = "eks-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:590184068436:route-table/rtb-02bdfb5911c8bcf60" -> null
      - id               = "rtb-02bdfb5911c8bcf60" -> null
      - owner_id         = "590184068436" -> null
      - propagating_vgws = [] -> null
      - region           = "us-east-1" -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-03cd6b26509b93ef3"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "my-eks-cluster-public-rt"
        } -> null
      - tags_all         = {
          - "Name" = "my-eks-cluster-public-rt"
        } -> null
      - vpc_id           = "vpc-073f94c7affa7476d" -> null
    }

  # aws_route_table.public_rt will be created
  + resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "eks-public-rt"
        }
      + tags_all         = {
          + "Name" = "eks-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0ddb6bec68592dcbc" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-0f06fbca14b1c11a5" -> null
      - subnet_id      = "subnet-0a194d64c04c62ef5" -> null
    }

  # aws_route_table_association.private[1] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-08ef114ff8a9f4791" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-0f06fbca14b1c11a5" -> null
      - subnet_id      = "subnet-0a5687f9ed0aec9eb" -> null
    }

  # aws_route_table_association.private_rt_assoc_a will be created
  + resource "aws_route_table_association" "private_rt_assoc_a" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_rt_assoc_b will be created
  + resource "aws_route_table_association" "private_rt_assoc_b" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-05be6d6ef02b372b2" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-02bdfb5911c8bcf60" -> null
      - subnet_id      = "subnet-0bc99c5d9797184a3" -> null
    }

  # aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-00f63c9d86c283283" -> null
      - region         = "us-east-1" -> null
      - route_table_id = "rtb-02bdfb5911c8bcf60" -> null
      - subnet_id      = "subnet-0bf6d4cad207b9e2d" -> null
    }

  # aws_route_table_association.public_rt_assoc_a will be created
  + resource "aws_route_table_association" "public_rt_assoc_a" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_rt_assoc_b will be created
  + resource "aws_route_table_association" "public_rt_assoc_b" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.bastion will be destroyed
  # (because aws_security_group.bastion is not in configuration)
  - resource "aws_security_group" "bastion" {
      - arn                    = "arn:aws:ec2:us-east-1:590184068436:security-group/sg-01bb962ef6355449c" -> null
      - description            = "Security group for bastion host" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01bb962ef6355449c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "my-eks-cluster-bastion-sg" -> null
      - owner_id               = "590184068436" -> null
      - region                 = "us-east-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "my-eks-cluster-bastion-sg"
        } -> null
      - tags_all               = {
          - "Name" = "my-eks-cluster-bastion-sg"
        } -> null
      - vpc_id                 = "vpc-073f94c7affa7476d" -> null
    }

  # aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "eks-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_cluster will be destroyed
  # (because aws_security_group.eks_cluster is not in configuration)
  - resource "aws_security_group" "eks_cluster" {
      - arn                    = "arn:aws:ec2:us-east-1:590184068436:security-group/sg-063b926018fae23b2" -> null
      - description            = "Security group for EKS cluster control plane" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-063b926018fae23b2" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow worker nodes to communicate with cluster API Server"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01931baff116b047f",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "my-eks-cluster-cluster-sg" -> null
      - owner_id               = "590184068436" -> null
      - region                 = "us-east-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "my-eks-cluster-cluster-sg"
        } -> null
      - tags_all               = {
          - "Name" = "my-eks-cluster-cluster-sg"
        } -> null
      - vpc_id                 = "vpc-073f94c7affa7476d" -> null
    }

  # aws_security_group.eks_nodes will be destroyed
  # (because aws_security_group.eks_nodes is not in configuration)
  - resource "aws_security_group" "eks_nodes" {
      - arn                    = "arn:aws:ec2:us-east-1:590184068436:security-group/sg-01931baff116b047f" -> null
      - description            = "Security group for EKS worker nodes" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow pods to communicate with the cluster API Server"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-063b926018fae23b2",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - id                     = "sg-01931baff116b047f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 65535
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow cluster control plane to communicate with kubelet"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-063b926018fae23b2",
                ]
              - self             = false
              - to_port          = 10250
            },
        ] -> null
      - name                   = "my-eks-cluster-node-sg" -> null
      - owner_id               = "590184068436" -> null
      - region                 = "us-east-1" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "my-eks-cluster-node-sg"
        } -> null
      - tags_all               = {
          - "Name" = "my-eks-cluster-node-sg"
        } -> null
      - vpc_id                 = "vpc-073f94c7affa7476d" -> null
    }

  # aws_security_group_rule.cluster_inbound_https will be destroyed
  # (because aws_security_group_rule.cluster_inbound_https is not in configuration)
  - resource "aws_security_group_rule" "cluster_inbound_https" {
      - description              = "Allow worker nodes to communicate with cluster API Server" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1590711956" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-063b926018fae23b2" -> null
      - security_group_rule_id   = "sgr-03ea92c885505e4d9" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-01931baff116b047f" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.nodes_inbound_cluster_kubelet will be destroyed
  # (because aws_security_group_rule.nodes_inbound_cluster_kubelet is not in configuration)
  - resource "aws_security_group_rule" "nodes_inbound_cluster_kubelet" {
      - description              = "Allow cluster control plane to communicate with kubelet" -> null
      - from_port                = 10250 -> null
      - id                       = "sgrule-490981955" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-01931baff116b047f" -> null
      - security_group_rule_id   = "sgr-0ed296f50e46cc705" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-063b926018fae23b2" -> null
      - to_port                  = 10250 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.nodes_outbound_cluster_https will be destroyed
  # (because aws_security_group_rule.nodes_outbound_cluster_https is not in configuration)
  - resource "aws_security_group_rule" "nodes_outbound_cluster_https" {
      - description              = "Allow pods to communicate with the cluster API Server" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-358068930" -> null
      - protocol                 = "tcp" -> null
      - region                   = "us-east-1" -> null
      - security_group_id        = "sg-01931baff116b047f" -> null
      - security_group_rule_id   = "sgr-0015b07eba84e0281" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-063b926018fae23b2" -> null
      - to_port                  = 443 -> null
      - type                     = "egress" -> null
    }

  # aws_subnet.eks_subnet-a will be created
  + resource "aws_subnet" "eks_subnet-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                              = "pub-eks-subnet-a"
          + "Type"                              = "Public"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "pub-eks-subnet-a"
          + "Type"                              = "Public"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnet-b will be created
  + resource "aws_subnet" "eks_subnet-b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                              = "pub-eks-subnet-b"
          + "Type"                              = "Public"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "pub-eks-subnet-b"
          + "Type"                              = "Public"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnet-priv-a will be created
  + resource "aws_subnet" "eks_subnet-priv-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                              = "priv-eks-subnet-a"
          + "Type"                              = "Private"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "priv-eks-subnet-a"
          + "Type"                              = "Private"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.eks_subnet-priv-b will be created
  + resource "aws_subnet" "eks_subnet-priv-b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.40.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                              = "priv-eks-subnet-b"
          + "Type"                              = "Private"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + tags_all                                       = {
          + "Name"                              = "priv-eks-subnet-b"
          + "Type"                              = "Private"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
          + "kubernetes.io/role/elb"            = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[0] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:590184068436:subnet/subnet-0a194d64c04c62ef5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a194d64c04c62ef5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "590184068436" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                 = "my-eks-cluster-private-subnet-1"
          - "Type"                                 = "Private"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"      = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                 = "my-eks-cluster-private-subnet-1"
          - "Type"                                 = "Private"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"      = "1"
        } -> null
      - vpc_id                                         = "vpc-073f94c7affa7476d" -> null
    }

  # aws_subnet.private[1] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:590184068436:subnet/subnet-0a5687f9ed0aec9eb" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.48.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a5687f9ed0aec9eb" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "590184068436" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                 = "my-eks-cluster-private-subnet-2"
          - "Type"                                 = "Private"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"      = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                 = "my-eks-cluster-private-subnet-2"
          - "Type"                                 = "Private"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/internal-elb"      = "1"
        } -> null
      - vpc_id                                         = "vpc-073f94c7affa7476d" -> null
    }

  # aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:590184068436:subnet/subnet-0bc99c5d9797184a3" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az4" -> null
      - cidr_block                                     = "10.0.0.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0bc99c5d9797184a3" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "590184068436" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                 = "my-eks-cluster-public-subnet-1"
          - "Type"                                 = "Public"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/elb"               = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                 = "my-eks-cluster-public-subnet-1"
          - "Type"                                 = "Public"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/elb"               = "1"
        } -> null
      - vpc_id                                         = "vpc-073f94c7affa7476d" -> null
    }

  # aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:590184068436:subnet/subnet-0bf6d4cad207b9e2d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.16.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0bf6d4cad207b9e2d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "590184068436" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - region                                         = "us-east-1" -> null
      - tags                                           = {
          - "Name"                                 = "my-eks-cluster-public-subnet-2"
          - "Type"                                 = "Public"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/elb"               = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                 = "my-eks-cluster-public-subnet-2"
          - "Type"                                 = "Public"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
          - "kubernetes.io/role/elb"               = "1"
        } -> null
      - vpc_id                                         = "vpc-073f94c7affa7476d" -> null
    }

  # aws_vpc.eks_vpc will be created
  + resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Name"                              = "-eks-vpc"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
        }
      + tags_all                             = {
          + "Name"                              = "-eks-vpc"
          + "kubernetes.io/cluster/eks-cluster" = "shared"
        }
    }

  # aws_vpc.main will be destroyed
  # (because aws_vpc.main is not in configuration)
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:us-east-1:590184068436:vpc/vpc-073f94c7affa7476d" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-005167a6ab9f06086" -> null
      - default_route_table_id               = "rtb-04b10d481ffe806ba" -> null
      - default_security_group_id            = "sg-0959491f8cbb3cbb9" -> null
      - dhcp_options_id                      = "dopt-08367980d4a11c17f" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-073f94c7affa7476d" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-04b10d481ffe806ba" -> null
      - owner_id                             = "590184068436" -> null
      - region                               = "us-east-1" -> null
      - tags                                 = {
          - "Name"                                 = "my-eks-cluster-vpc"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
        } -> null
      - tags_all                             = {
          - "Name"                                 = "my-eks-cluster-vpc"
          - "kubernetes.io/cluster/my-eks-cluster" = "shared"
        } -> null
    }

Plan: 29 to add, 0 to change, 43 to destroy.

Changes to Outputs:
  - bastion_instance_id                = "i-04e25022a087c72f0" -> null
  - bastion_public_ip                  = "54.196.153.130" -> null
  - bastion_role_arn                   = "arn:aws:iam::590184068436:role/my-eks-cluster-bastion-role" -> null
  - cluster_arn                        = "arn:aws:eks:us-east-1:590184068436:cluster/my-eks-cluster" -> null
  - cluster_certificate_authority_data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJVTRIb0YyMUhESzh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRBNE1UQXhOREV5TXpsYUZ3MHpOVEE0TURneE5ERTNNemxhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURQYlh3VGpGSVFocDQ5Z2VQRkdnYS82Ukg0eUxzRkxsM3draVVaQXVrMEU3Qk0wT2V4ZjdnOVFSaDUKZjNEUThtbVhSUHlycjBpbEVIVzJPZGRGSW9sQ04xNWZBSmxQWUJDTkMxWEFmUlduNTJIcnVNZSsxUnBZZmU4awo4S3J2Z01XY2h6QzdwT1NTRjF3WDFWOXNPd2FNb2tYaHVwUDZTUHozQUd5VDVNMFMyT3FtQVFmUlZwTFFCS3doCitWaTZYVHRKRXZRaklQbGxLdHNXcUJKQWJUTjZqV1ZJa25wUE03S00vZWFVMzZYSVpmMllqZnN5Y2dlWHpQd3AKalpETlpMNWdOM2NoWEc5YXVMQ2p4elJkcXVDd3NUQzdZdk1JVEZva21yQ3NaQUgvSGtIZkRraHhzeUc5YnFsSgpjTUtwb3pWOWpOYUkyWVoxZ1daZ2diNXBpQWliQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRdnlYNXRpQStsdW95YjN0V01rZ0lXRDV5NVpEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUZGMDVEN0lUawo0Y2JHblpjTy9WN1Y0MkV6VnE2bXE5ZG9pTHVZOWNrRkFBOWJtUVA1L2VEZmR6QXRDa0JtS25rY1dnZnNsMkVjCk9pb3lYZWc1RHErNmlpQ2tnZXZRWnBRZ295RStac3NzVVNNUU5VMS9HUkk1UmlITlR0N2tVSzl2ZFd1VHZHTTQKbm53QkFSWFRuTTBzcktXWkpjOTNoOUU0NEN3UTN2d2RLTU1sc2ZtVTJVNmZwVHgxTUd2elJoRTg1K3VzNkl0RQpuTjNQU2xCdkJzVHFXRXkzbEVTNjJPN1FrZmx4L0ZmZThoSGExRVRZZGtzbFBDUSttS1FxYStPYjU3aUh4UW1NCk1MVDR6UnVDUUhqY2g2Q1J2bC9TcFVKZ1RVbHppczZkOGJ1MHFOamlNSGlWU2c4cytCcTBrZlE2MWkzcTl4Vy8KenZITHNlQzBEdm41Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null
  - cluster_endpoint                   = "https://BFF4F811F0EACB4D8581ED34E0C79FE4.gr7.us-east-1.eks.amazonaws.com" -> null
  - cluster_name                       = "my-eks-cluster" -> null
  - cluster_oidc_issuer_url            = "https://oidc.eks.us-east-1.amazonaws.com/id/BFF4F811F0EACB4D8581ED34E0C79FE4" -> null
  - cluster_role_arn                   = "arn:aws:iam::590184068436:role/my-eks-cluster-cluster-role" -> null
  - cluster_security_group_id          = "sg-08308399422dbb0a7" -> null
  - ecr_repository_url                 = "590184068436.dkr.ecr.us-east-1.amazonaws.com/my-eks-cluster-app" -> null
  - node_group_arn                     = "arn:aws:eks:us-east-1:590184068436:nodegroup/my-eks-cluster/my-eks-cluster-nodes/72cc4a2e-dc34-5a17-44fb-ff5057640694" -> null
  - node_role_arn                      = "arn:aws:iam::590184068436:role/my-eks-cluster-node-group-role" -> null
  - private_subnet_ids                 = [
      - "subnet-0a194d64c04c62ef5",
      - "subnet-0a5687f9ed0aec9eb",
    ] -> null
  - public_subnet_ids                  = [
      - "subnet-0bc99c5d9797184a3",
      - "subnet-0bf6d4cad207b9e2d",
    ] -> null
  - vpc_id                             = "vpc-073f94c7affa7476d" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*